# Pandas
* Pandas is a open source python library designed specifically for accomplishing data analysis tasks.

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = [10, 20, 30, 40, 50]
type(data)

list

In [8]:
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
type(series)

pandas.core.series.Series

In [10]:
dict = {
    "name": "Rajendra",
    "age": 23,
    "address": "Bhaktapur"
}

In [12]:
dict_series = pd.Series(dict)

In [13]:
type(dict_series)

pandas.core.series.Series

In [15]:
arr = np.array(data)
arr

array([10, 20, 30, 40, 50])

In [17]:
arr_series = pd.Series(arr)
arr_series

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [18]:
type(arr_series)

pandas.core.series.Series

In [21]:
arr_series.shape

(5,)

# DataFrame

In [35]:
nested_list = [[30, 40, 20], [20, 50, 10], [20, 50, 20]]

In [36]:
pd.DataFrame(nested_list, columns=["col1", "col2", "col3"])

   col1  col2  col3
0    30    40    20
1    20    50    10
2    20    50    20

In [37]:
nested_list[1][-1]

10

In [38]:
len(nested_list)

3

In [57]:
data_dict = {
    "Name": ["Rajendra", "Naresh", "Mohan"],
    "Age": [23, 23, 34]
}

In [55]:
dict_df = pd.DataFrame(data_dict)

In [56]:
dict_df

       name  age
0  Rajendra   23
1    Naresh   23
2     Mohan   34

In [59]:
dict_df.columns = ["name", "age"]

In [60]:
dict_df

       name  age
0  Rajendra   23
1    Naresh   23
2     Mohan   34

In [61]:
type(dict_df)

pandas.core.frame.DataFrame

In [73]:
list_dict = [{"name": "Rajendra", "age": 23, "address": "Bhaktapur"}, {"name": "Mohan", "age": 33, "address": "panauti"}, {"name": "Naresh", "address": "Bhaktapur"}]

In [74]:
pd.DataFrame(list_dict)

       name   age    address
0  Rajendra  23.0  Bhaktapur
1     Mohan  33.0    panauti
2    Naresh   NaN  Bhaktapur

In [87]:
df = pd.read_csv("car_details.csv")

In [88]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [101]:
import openpyxl

df.to_excel("excel.xlsx", engine=openpyxl)

ValueError: No Excel writer '<module 'openpyxl' from 'g:\\Data science and ml metro\\env\\Lib\\site-packages\\openpyxl\\__init__.py'>'